app/views/articles/_form.html.erb

      <%= f.label :author %><br>
      <%= collection_select(:article, :author_id, Author.all, :id, :first_name, include_blank: true) %>
---
SELECT "authors".* FROM "authors"

      <%= f.label :tag, "Tags" %><br>
      <%= collection_check_boxes(:article, :tag_ids, Tag.all, :id, :name) %>
---
SELECT "tags".* FROM "tags"