app/controllers/authors_controller.rb

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "anna"], ["last_name", "zeng"], ["created_at", "2016-03-20 17:22:02.525236"], ["updated_at", "2016-03-20 17:22:02.525236"]]
---
  def create
    @author = Author.new(author_params)

    if @author.save

UPDATE "authors" SET "first_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["first_name", "anna2"], ["updated_at", "2016-03-20 17:23:07.883144"], ["id", 5]]
---
  def update
    if @author.update(author_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 6]]
---
  def find_Author
    @author = Author.find(params[:id])