app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sundays"], ["created_at", "2016-03-20 17:35:03.383683"], ["updated_at", "2016-03-20 17:35:03.383683"]]
---
  def create
    @tag = Tag.new(tag_params)

    if @tag.save

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 6]]
---
  def destroy
    @tag.destroy

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 6]]
---
  def find_Tag
    @tag = Tag.find(params[:id])